Cases/simpleFoam/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    INLET
    {
        type            fixedValue;
        value           uniform (3.53e-06 0 0);
    }
    BACK-FRONT
    {
        type            symmetry;
    }
    OUTLET
    {
        type            zeroGradient;
    }
    GRAIN
    {
        type            noSlip;
    }
    frontAndBackPlanes
    {
        type            empty;

    }
}

// ************************************************************************* //
