Cases/simpleFoam/0/v2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      v2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

iinternalField   uniform 0;

boundaryField
{
    INLET
    {
        type            zeroGradient;
    }
    BACK-FRONT
    {
        type            symmetry;
    }
    OUTLET
    {
        type            fixedValue;
        value           uniform 0;
    }
    GRAIN
    {
        type            zeroGradient;
    }
    frontAndBackPlanes
    {
        type            empty;

    }
}

// ************************************************************************* //
