Cases/simpleFoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    INLET
    {
        type            patch;
        nFaces          250;
        startFace       471267;
    }
    BACK-FRONT
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          850;
        startFace       471517;
    }
    OUTLET
    {
        type            patch;
        nFaces          250;
        startFace       472367;
    }
    GRAIN
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          11340;
        startFace       472617;
    }
    frontAndBackPlanes
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          477612;
        startFace       483957;
    }
)

// ************************************************************************* //
