Cases/simpleFoam/system/streamlines
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out files of streamlines with interpolated field data in VTK format.

\*---------------------------------------------------------------------------*/

direction       forward;

seedSampleSet
{
    type            lineUniform;
    start           (-0.0006 0.0000 0.0000);
    end             (-0.0006 0.0014 0.0000);
    nPoints         50;
    axis            y;
}

fields          (p U);

#includeEtc "caseDicts/postProcessing/visualization/streamlines.cfg"

// ************************************************************************* //
